AeRgIo74/tiva_prueb2_2/examples/boards/ek-tm4c1294xl/parcial1/parcial1.c
#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/pwm.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"
#include "inc/hw_ints.h"
#include "inc/hw_adc.h"
#include "inc/hw_types.h"
#include "driverlib/adc.h"
#include "driverlib/interrupt.h"
#include "driverlib/systick.h"
#include "driverlib/timer.h"
#include <string.h> // Para strlen
#include "driverlib/fpu.h"
#include "driverlib/timer.h" 
#include <stdio.h>
#include <ctype.h>
#include <stdlib.h>


// System clock rate in Hz.
uint32_t g_ui32SysClock;

// The error routine that is called if the driver library encounters an error.
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif


uint32_t distance;
uint32_t start_time, end_time;
volatile bool echo_received = false;

// ISR para capturar los eventos de la señal Echo
void EchoIntHandler(void)
{
    // Limpiar la interrupción
    GPIOIntClear(GPIO_PORTB_BASE, GPIO_PIN_4);

    if (GPIOPinRead(GPIO_PORTB_BASE, GPIO_PIN_4))
    {
        // Señal de Echo sube: inicio del pulso
        TimerEnable(TIMER0_BASE, TIMER_A);
        start_time = TimerValueGet(TIMER0_BASE, TIMER_A);
    }
    else
    {
        // Señal de Echo baja: fin del pulso
        end_time = TimerValueGet(TIMER0_BASE, TIMER_A);
        echo_received = true;
        TimerDisable(TIMER0_BASE, TIMER_A);
    }
}

/// Configuración de pines
void config_ultrasonic(void){
    // Configurar Trigger y Echo
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_5);  // Trigger pin
    GPIOPinTypeGPIOInput(GPIO_PORTB_BASE, GPIO_PIN_4);   // Echo pin

    // Configurar interrupciones para el pin Echo
    GPIOIntRegister(GPIO_PORTB_BASE, EchoIntHandler);
    GPIOIntTypeSet(GPIO_PORTB_BASE, GPIO_PIN_4, GPIO_BOTH_EDGES);
    GPIOIntEnable(GPIO_PORTB_BASE, GPIO_PIN_4);

    // Configurar Timer0 para medir el tiempo del Echo
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    TimerConfigure(TIMER0_BASE, TIMER_CFG_ONE_SHOT_UP);
}

void distancia(void){
    // Generar pulso de Trigger
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, GPIO_PIN_5);
    SysCtlDelay(g_ui32SysClock / (1000000 * 3));  // Delay 10 us
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, 0);

    // Esperar hasta que se reciba la señal Echo
    while (!echo_received);

    // Calcular la distancia en cm
    uint32_t time_diff = end_time - start_time;
    distance = ((time_diff / 120) * 0.034) / 2;  // Usar la fórmula de la velocidad del sonido
    echo_received = false;
}



void configura_TIMER2(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);
    TimerConfigure(TIMER2_BASE, TIMER_CFG_PERIODIC);
    TimerLoadSet(TIMER2_BASE, TIMER_A, g_ui32SysClock*2);
    IntEnable(INT_TIMER2A);
    TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    TimerEnable(TIMER2_BASE, TIMER_A);
}
volatile bool ledState1 = false;
uint32_t send = 0;
uint32_t marcador;
void Timer2IntHandler(void)
{
 
    TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    if (distance <= 7){
        send++;
        GPIOPinWrite(GPIO_PORTE_BASE, GPIO_PIN_4, GPIO_PIN_4);
        PWMPulseWidthSet(PWM0_BASE, PWM_OUT_5, (PWMGenPeriodGet(PWM0_BASE, PWM_GEN_2)*0.05));
        UARTSend((uint8_t *)"quieto", 6);
        UARTSend((uint8_t *)"\n", 1);
        if (send == 1){
            UARTSend((uint8_t *)"alerta", 6);
            UARTSend((uint8_t *)"\n", 1);
        }
        // Alternar el estado del LED
        ledState1 = !ledState1;
        //UARTSend((uint8_t *)"alerta", 6);
        GPIOPinWrite(GPIO_PORTE_BASE, GPIO_PIN_5, ledState1 ? GPIO_PIN_5 : 0);
    }
    else{
        GPIOPinWrite(GPIO_PORTE_BASE, GPIO_PIN_5, 0);
        send =0;
        GPIOPinWrite(GPIO_PORTE_BASE, GPIO_PIN_4, 0);
        PWMPulseWidthSet(PWM0_BASE, PWM_OUT_5, (PWMGenPeriodGet(PWM0_BASE, PWM_GEN_2)*0.0));
        if (marcador == 0)
        {
            UARTSend((uint8_t *)"derecha", 7);
            UARTSend((uint8_t *)"\n", 1);
        }
        else if (marcador == 1)
        {
            UARTSend((uint8_t *)"adelante", 8);
            UARTSend((uint8_t *)"\n", 1);
        }
        else if (marcador == 2)
        {
            UARTSend((uint8_t *)"quieto", 7);
            UARTSend((uint8_t *)"\n", 1);
        }
        
    }
    IntMasterEnable();
}
void configura_TIMER1(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER1);
    TimerConfigure(TIMER1_BASE, TIMER_CFG_PERIODIC);
    TimerLoadSet(TIMER1_BASE, TIMER_A, g_ui32SysClock);
    IntEnable(INT_TIMER1A);
    TimerIntEnable(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    TimerEnable(TIMER1_BASE, TIMER_A);
}
volatile bool ledState = false;
void Timer1IntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    if (distance >= 20){
        // Alternar el estado del LED
        ledState = !ledState;
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, ledState ? GPIO_PIN_1 : 0);
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, ledState ? 0 : GPIO_PIN_0);
    }
    else{
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, 0);
    }

    IntMasterEnable();
}


//*****************************************************************************
//
// The UART interrupt handler.
//
//*****************************************************************************
void UARTConfig(void){
    // Configurar UART para mostrar los datos en la consola
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART6);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);
    GPIOPinConfigure(GPIO_PP0_U6RX);
    GPIOPinConfigure(GPIO_PP1_U6TX);
    GPIOPinTypeUART(GPIO_PORTP_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    UARTConfigSetExpClk(UART6_BASE, g_ui32SysClock, 9600,
                            (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                             UART_CONFIG_PAR_NONE));

    
    
