AeRgIo74/tiva_prueb2_2/examples/boards/ek-tm4c1294xl/parcial1/parcial1.c
}
void interrupcio_UART(void){
    // Habilitar interrupciones UART
    IntEnable(INT_UART6);
    UARTIntEnable(UART6_BASE, UART_INT_RX | UART_INT_RT);
}
#define BUFFER_SIZE 128
char buffer[BUFFER_SIZE];
uint32_t bufferIndex = 0;
char receivedChar;
uint32_t contador = 0;
uint32_t direccion;
uint32_t valor;
void UARTIntHandler(void)
{
    uint32_t ui32Status;
    int numLength = 0;     // Variable para almacenar el número de dígitos del número recibido
    int contadorLength = 0; // Variable para almacenar el número de dígitos del contador

    //
    // Get the interrrupt status.
    //
    ui32Status = UARTIntStatus(UART6_BASE, true);

    //
    // Clear the asserted interrupts.
    //
    UARTIntClear(UART6_BASE, ui32Status);

    //
    // Loop while there are characters in the receive FIFO.
    //
    // Reiniciar el índice del buffer
    bufferIndex = 0;
    memset(buffer, 0, BUFFER_SIZE);  // Limpiar el buffer
    contador = 0;
    while(UARTCharsAvail(UART6_BASE))
    {
        //
        // Read the next character from the UART and write it back to the UART.
        //
        receivedChar = UARTCharGetNonBlocking(UART6_BASE);
        // Solo almacenar si hay espacio en el buffer
        if (bufferIndex < BUFFER_SIZE - 1) {
            buffer[bufferIndex++] = receivedChar; // Almacena el carácter
            buffer[bufferIndex] = '\0'; // Asegúrate de que el string esté terminado
            // Si recibimos un salto de línea o un espacio (indicador de fin de palabra)
                // Comprobar si la palabra recibida es "adelante"
            if (isdigit(receivedChar)) {
                // Convertir la cadena a entero usando atoi
                contador = contador * 10 + (receivedChar - '0'); 
                numLength++;  // Increment the count of numeric characters
            }
            if (strcmp(buffer, "adelante") == 0) {
                direccion = 1; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "atras") == 0) {
                direccion = 2; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "quieto") == 0) {
                direccion = 0; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "derecha") == 0) {
                direccion = 3; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "izquier") == 0) {
                direccion = 4; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "dder") == 0) {
                direccion = 5; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "iizq") == 0) {
                direccion = 6; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "ader") == 0) {
                direccion = 7; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "aizq") == 0) {
                direccion = 8; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "bder") == 0) {
                direccion = 9; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "bizq") == 0) {
                direccion = 10; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "gder") == 0) {
                direccion = 11; // Asignar 1 si la palabra es "adelante"
            }
            else if (strcmp(buffer, "gizq") == 0) {
                direccion = 12; // Asignar 1 si la palabra es "adelante"
            }
            // Si se recibe un salto de línea, convertir a entero
            
        }
    }
    int tempContador = contador;
    do
    {
        contadorLength++;       // Incrementa la longitud del contador
        tempContador /= 10;     // Divide el número entre 10 para remover el último dígito
    } while (tempContador != 0);
    if (numLength == contadorLength)
    {
        // Si las longitudes coinciden, puedes tomar alguna acción
        valor = contador;
    }
}

void UARTSend(const uint8_t *pui8Buffer, uint32_t ui32Count)
{
    //
    // Loop while there are more characters to send.
    //
    while(ui32Count--)
    {
        //
        // Write the next character to the UART.
        //
        UARTCharPutNonBlocking(UART6_BASE, *pui8Buffer++);
    }
}

void IntToChar(uint32_t value, char *buffer) {
    int i = 0;
    int j;
    char temp;

    // Manejar el caso de valor 0
    if (value == 0) {
        buffer[i++] = '0';
        buffer[i] = '\0'; // Terminar cadena
        return;
    }

    // Extraer cada dígito del número
    while (value > 0) {
        buffer[i++] = (value % 10) + '0';  // Convertir el dígito a su valor ASCII
        value /= 10;
    }

    // Terminar cadena
    buffer[i] = '\0';

    // Invertir la cadena porque los dígitos están al revés
    for (j = 0; j < i / 2; j++) {
        temp = buffer[j];
        buffer[j] = buffer[i - j - 1];
        buffer[i - j - 1] = temp;
    }
}
void FloatToChar(float value, char *buffer, int decimalPlaces) {
    int i = 0;

    // Manejar el caso de valor 0
    if (value == 0.0f) {
        buffer[i++] = '0';
        buffer[i] = '\0'; // Terminar cadena
        return;
    }

    // Manejar números negativos
    if (value < 0.0f) {
        buffer[i++] = '-';
        value = -value; // Hacer el valor positivo
    }

    // Obtener la parte entera
    uint32_t intPart = (uint32_t)value;
    float fracPart = value - intPart;

    // Extraer cada dígito de la parte entera
    char intBuffer[12]; // Buffer temporal para la parte entera
    int intIndex = 0;

    while (intPart > 0) {
        intBuffer[intIndex++] = (intPart % 10) + '0';  // Convertir el dígito a su valor ASCII
        intPart /= 10;
    }

    // Invertir la parte entera en el buffer
    for (int j = 0; j < intIndex / 2; j++) {
        char temp = intBuffer[j];
        intBuffer[j] = intBuffer[intIndex - j - 1];
        intBuffer[intIndex - j - 1] = temp;
    }

    // Agregar la parte entera al buffer principal
    for (int j = 0; j < intIndex; j++) {
        buffer[i++] = intBuffer[j];
    }

    // Agregar la parte decimal
    buffer[i++] = '.'; // Agregar el punto decimal

    // Extraer y agregar los dígitos de la parte decimal
    for (int j = 0; j < decimalPlaces; j++) {
        fracPart *= 10.0f;
        int digit = (int)fracPart;
        buffer[i++] = digit + '0'; // Convertir el dígito a su valor ASCII
        fracPart -= digit; // Mantener la parte decimal restante
    }

    // Terminar cadena
    buffer[i] = '\0';
}
///GPIOS
void GPIO_K(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
    GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3);
}
void GPIO_L(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOL);
    GPIOPinTypeGPIOOutput(GPIO_PORTL_BASE, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3);
}
void user_led_N(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_1|GPIO_PIN_0);
}
void user_led_F(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_4|GPIO_PIN_0);
}
void GPIO_E(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
    GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, GPIO_PIN_4|GPIO_PIN_5);
}

///PWM
void ConfigurePWM_G0(void)
{
    uint32_t ui32PWMClockRate;

    //
    // The PWM peripheral must be enabled for use.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);

    //
    // Enable the GPIO port that is used for the PWM output.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);

    //
    // Configure the PWM function for this pin.
    //
    GPIOPinConfigure(GPIO_PG0_M0PWM4);
    GPIOPinTypePWM(GPIO_PORTG_BASE, GPIO_PIN_0);

    //
    // Set the PWM clock to be SysClk / 8.
    //
    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_8);

    //
    // Use a local variable to store the PWM clock rate which will be
    // 120 MHz / 8 = 15 MHz. This variable will be used to set the
    // PWM generator period.
    //
    ui32PWMClockRate = g_ui32SysClock / 8;

    //
    // Configure PWM2 to count up/down without synchronization.
    //
    PWMGenConfigure(PWM0_BASE, PWM_GEN_2, PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Set the PWM period to 250Hz.
    //
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_2, (ui32PWMClockRate / 250));

    //
    // Set initial duty cycle to 0%.
    //
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_4, 0);

    //
    // Enable PWM Out Bit 2 (PF2) output signal.
    //
    PWMOutputState(PWM0_BASE, PWM_OUT_4_BIT, true);

    //
    // Enable the PWM generator block.
    //
    PWMGenEnable(PWM0_BASE, PWM_GEN_2);
}
void ConfigurePWM_F3(void)
{
    uint32_t ui32PWMClockRate;

    //
    // The PWM peripheral must be enabled for use.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);

    //
    // Enable the GPIO port that is used for the PWM output.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    //
    // Configure the PWM function for this pin.
    //
    GPIOPinConfigure(GPIO_PF3_M0PWM3);
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_3);

    //
    // Set the PWM clock to be SysClk / 8.
    //
    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_8);

    //
    // Use a local variable to store the PWM clock rate which will be
    // 120 MHz / 8 = 15 MHz. This variable will be used to set the
    // PWM generator period.
    //
    ui32PWMClockRate = g_ui32SysClock / 8;

    //
    // Configure PWM2 to count up/down without synchronization.
    //
    PWMGenConfigure(PWM0_BASE, PWM_GEN_1, PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Set the PWM period to 250Hz.
    //
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_1, (ui32PWMClockRate / 250));

    //
    // Set initial duty cycle to 0%.
    //
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_3, 0);

    //
    // Enable PWM Out Bit 2 (PF2) output signal.
    //
    PWMOutputState(PWM0_BASE, PWM_OUT_3_BIT, true);

    //
    // Enable the PWM generator block.
    //
    PWMGenEnable(PWM0_BASE, PWM_GEN_1);
}
void ConfigurePWM_F2(void)
{
    uint32_t ui32PWMClockRate;

    //
    // The PWM peripheral must be enabled for use.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);

    //
    // Enable the GPIO port that is used for the PWM output.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    //
    // Configure the PWM function for this pin.
    //
    GPIOPinConfigure(GPIO_PF2_M0PWM2);
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_2);

    //
    // Set the PWM clock to be SysClk / 8.
    //
    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_8);

    //
    // Use a local variable to store the PWM clock rate which will be
    // 120 MHz / 8 = 15 MHz. This variable will be used to set the
    // PWM generator period.
    //
    ui32PWMClockRate = g_ui32SysClock / 8;

    //
    // Configure PWM2 to count up/down without synchronization.
    //
    PWMGenConfigure(PWM0_BASE, PWM_GEN_1, PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Set the PWM period to 250Hz.
    //
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_1, (ui32PWMClockRate / 250));

    //
    // Set initial duty cycle to 0%.
    //
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, 0);

    //
    // Enable PWM Out Bit 2 (PF2) output signal.
    //
    PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, true);

    //
    // Enable the PWM generator block.
    //
    PWMGenEnable(PWM0_BASE, PWM_GEN_1);
}
void ConfigurePWM_F1(void)
{
    uint32_t ui32PWMClockRate;

    //
    // The PWM peripheral must be enabled for use.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);

    //
    // Enable the GPIO port that is used for the PWM output.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    //
    // Configure the PWM function for this pin.
    //
    GPIOPinConfigure(GPIO_PF1_M0PWM1);
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_1);

    //
    // Set the PWM clock to be SysClk / 8.
    //
    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_8);

    //
    // Use a local variable to store the PWM clock rate which will be
    // 120 MHz / 8 = 15 MHz. This variable will be used to set the
    // PWM generator period.
    //
    ui32PWMClockRate = g_ui32SysClock / 8;

    //
    // Configure PWM2 to count up/down without synchronization.
    //
    PWMGenConfigure(PWM0_BASE, PWM_GEN_0, PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Set the PWM period to 250Hz.
    //
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_0, (ui32PWMClockRate / 250));

    //
    // Set initial duty cycle to 0%.
    //
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_1, 0);

    //
    // Enable PWM Out Bit 2 (PF2) output signal.
    //
    PWMOutputState(PWM0_BASE, PWM_OUT_1_BIT, true);

    //
    // Enable the PWM generator block.
    //
    PWMGenEnable(PWM0_BASE, PWM_GEN_0);
}
void ConfigurePWM_G1(void)
{
    uint32_t ui32PWMClockRate;

    //
    // The PWM peripheral must be enabled for use.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);

    //
    // Enable the GPIO port that is used for the PWM output.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);

    //
    // Configure the PWM function for this pin.
    //
    GPIOPinConfigure(GPIO_PG1_M0PWM5);
    GPIOPinTypePWM(GPIO_PORTG_BASE, GPIO_PIN_1);

    //
    // Set the PWM clock to be SysClk / 8.
    //
    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_8);

    //
    // Use a local variable to store the PWM clock rate which will be
    // 120 MHz / 8 = 15 MHz. This variable will be used to set the
    // PWM generator period.
    //
    ui32PWMClockRate = g_ui32SysClock / 8;

    //
    // Configure PWM2 to count up/down without synchronization.
    //
    PWMGenConfigure(PWM0_BASE, PWM_GEN_2, PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Set the PWM period to 250Hz.
    //
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_2, (ui32PWMClockRate / 250));

    //
    // Set initial duty cycle to 0%.
    //
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_5, 0);

    //
    // Enable PWM Out Bit 2 (PF2) output signal.
    //
    PWMOutputState(PWM0_BASE, PWM_OUT_5_BIT, true);

    //
    // Enable the PWM generator block.
    //
    PWMGenEnable(PWM0_BASE, PWM_GEN_2);
}

// Definición de la estructura Motor
typedef struct Motor {
    uint32_t puerto; // El puerto GPIO (por ejemplo, GPIO_PORTL_BASE)
    uint8_t pinA;    // Primer pin del puente H
    uint8_t pinB;    // Segundo pin del puente H
} Motor;

// Función para inicializar el motor
void Motor_init(Motor* motor, uint32_t p, uint8_t pA, uint8_t pB) {
    motor->puerto = p;
    motor->pinA = pA;
    motor->pinB = pB;
}
// Movimiento hacia adelante
void motorAdelante(Motor* motor) {
    GPIOPinWrite(motor->puerto, motor->pinA | motor->pinB, motor->pinA); // Activa pinA, desactiva pinB
}

// Movimiento hacia atrás
void motorAtras(Motor* motor) {
    GPIOPinWrite(motor->puerto, motor->pinA | motor->pinB, motor->pinB); // Activa pinB, desactiva pinA
}

// Detener motor
void motorDetener(Motor* motor) {
    GPIOPinWrite(motor->puerto, motor->pinA | motor->pinB, 0); // Desactiva ambos pines
}
// Estructura para controlar múltiples motores
typedef struct ControlMotores {
    Motor motores[4]; // Array para almacenar 4 motores
} ControlMotores;
// Inicializar control de motores
void ControlMotores_init(ControlMotores* control) {
    // Inicializar motores, cada uno con un puerto y dos pines
    Motor_init(&control->motores[0], GPIO_PORTL_BASE, GPIO_PIN_0, GPIO_PIN_1); // Motor 1
    Motor_init(&control->motores[1], GPIO_PORTL_BASE, GPIO_PIN_2, GPIO_PIN_3); // Motor 2
    Motor_init(&control->motores[2], GPIO_PORTK_BASE, GPIO_PIN_0, GPIO_PIN_1); // Motor 3
    Motor_init(&control->motores[3], GPIO_PORTK_BASE, GPIO_PIN_2, GPIO_PIN_3); // Motor 4
}
// Movimiento hacia adelante de un motor específico
void ControlMotores_moverAdelante(ControlMotores* control, int motorId) {
    motorAdelante(&control->motores[motorId]);
}

// Movimiento hacia atrás de un motor específico
void ControlMotores_moverAtras(ControlMotores* control, int motorId) {
    motorAtras(&control->motores[motorId]);
}

