AeRgIo74/tiva_prueb2_2/examples/boards/ek-tm4c1294xl/parcial1/parcial1.c
// Detener un motor específico
void ControlMotores_detenerMotor(ControlMotores* control, int motorId) {
    motorDetener(&control->motores[motorId]);
}

// Definición de la estructura PWM
typedef struct PWM {
    uint32_t base; // Base del PWM
    uint32_t output; // Salida del PWM
    uint32_t gen; // Generador del PWM
} PWM;

// Función para inicializar un PWM
void PWM_init(PWM* pwm, uint32_t base, uint32_t output, uint32_t gen) {
    pwm->base = base;
    pwm->output = output;
    pwm->gen = gen;
}

// Función para configurar el ancho de pulso
void PWM_setDutyCycle(PWM* pwm, float dutyCycle) {
    uint32_t period = PWMGenPeriodGet(pwm->base, pwm->gen);
    PWMPulseWidthSet(pwm->base, pwm->output, (period * dutyCycle));
}

// Función para inicializar y configurar los PWMs
void PWM_configurar(PWM* pwms) {
    PWM_init(&pwms[0], PWM0_BASE, PWM_OUT_1, PWM_GEN_0);
    PWM_init(&pwms[1], PWM0_BASE, PWM_OUT_2, PWM_GEN_1);
    PWM_init(&pwms[2], PWM0_BASE, PWM_OUT_3, PWM_GEN_1);
    PWM_init(&pwms[3], PWM0_BASE, PWM_OUT_4, PWM_GEN_2);
}
float dutyCycle;
//*****************************************************************************
//
// This example demonstrates how to send a string of data to the UART.
//
//*****************************************************************************
int
main(void)
{
    //
    // Run from the PLL at 120 MHz.
    // Note: SYSCTL_CFG_VCO_240 is a new setting provided in TivaWare 2.2.x and
    // later to better reflect the actual VCO speed due to SYSCTL#22.
    //
    g_ui32SysClock = SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_240), 120000000);


    //
    // Enable processor interrupts.
    //
    IntMasterEnable();

    UARTConfig(),

    interrupcio_UART();
    //
    // Prompt for text to be entered.
    //
    UARTSend((uint8_t *)"\033[2JEnter text: ", 16);

    //
    // Loop forever echoing data through the UART.
    //
    //ultrasonic
    config_ultrasonic();
    ///pwm
    ConfigurePWM_F1();
    ConfigurePWM_F2();
    ConfigurePWM_F3();
    ConfigurePWM_G0();
    ConfigurePWM_G1();
    ///gpios
    GPIO_L();
    GPIO_K();
    user_led_F();
    user_led_N();
    GPIO_E();
    configura_TIMER1();
    configura_TIMER2();
    // Crear objeto de control de motores
    ControlMotores controlMotores;
    ControlMotores_init(&controlMotores);

    PWM pwms[4];
    // Inicializar y configurar PWMs
    PWM_configurar(pwms);
    while(1)
    {
        dutyCycle = (float)20/100;
        distancia();
        if (distance >= 20)
        {
            marcador =0;
            ControlMotores_moverAtras(&controlMotores, 3);
            ControlMotores_moverAtras(&controlMotores, 2);
            ControlMotores_moverAdelante(&controlMotores, 1);
            ControlMotores_moverAdelante(&controlMotores, 0);
            PWM_setDutyCycle(&pwms[3], dutyCycle);
            PWM_setDutyCycle(&pwms[2], dutyCycle*0.2);
            PWM_setDutyCycle(&pwms[1], dutyCycle);
            PWM_setDutyCycle(&pwms[0], dutyCycle*0.2);
        }
        else{
            marcador =1;
            ControlMotores_moverAdelante(&controlMotores, 0);
            ControlMotores_moverAdelante(&controlMotores, 1);
            ControlMotores_moverAdelante(&controlMotores, 2);
            ControlMotores_moverAdelante(&controlMotores, 3);
            PWM_setDutyCycle(&pwms[3], dutyCycle);
            PWM_setDutyCycle(&pwms[2], dutyCycle);
            PWM_setDutyCycle(&pwms[1], dutyCycle);
            PWM_setDutyCycle(&pwms[0], dutyCycle);
            if (distance <= 7){
                marcador =2;
                ControlMotores_detenerMotor(&controlMotores, 0);
                ControlMotores_detenerMotor(&controlMotores, 1);
                ControlMotores_detenerMotor(&controlMotores, 2);
                ControlMotores_detenerMotor(&controlMotores, 3);
                PWM_setDutyCycle(&pwms[3], dutyCycle*0.0);
                PWM_setDutyCycle(&pwms[2], dutyCycle*0.0);
                PWM_setDutyCycle(&pwms[1], dutyCycle*0.0);
                PWM_setDutyCycle(&pwms[0], dutyCycle*0.0);
            }
        }
    }
}
